{
  "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
  "displayName": "Windows 10 - General Availability",
  "description": null,
  "version": 1,
  "deliveryOptimizationMode": "userDefined",
  "prereleaseFeatures": "userDefined",
  "automaticUpdateMode": "autoInstallAndRebootAtMaintenanceTime",
  "microsoftUpdateServiceAllowed": true,
  "driversExcluded": false,
  "qualityUpdatesDeferralPeriodInDays": 0,
  "featureUpdatesDeferralPeriodInDays": 0,
  "qualityUpdatesPaused": false,
  "featureUpdatesPaused": false,
  "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "businessReadyUpdatesOnly": "userDefined",
  "skipChecksBeforeRestart": false,
  "featureUpdatesRollbackWindowInDays": 10,
  "qualityUpdatesWillBeRolledBack": false,
  "featureUpdatesWillBeRolledBack": false,
  "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "deadlineForFeatureUpdatesInDays": 3,
  "deadlineForQualityUpdatesInDays": 3,
  "deadlineGracePeriodInDays": 2,
  "postponeRebootUntilAfterDeadline": false,
  "autoRestartNotificationDismissal": "notConfigured",
  "userPauseAccess": "disabled",
  "userWindowsUpdateScanAccess": "enabled",
  "updateNotificationLevel": "defaultNotifications",
  "allowWindows11Upgrade": false,
  "installationSchedule": {
    "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
    "activeHoursStart": "09:00:00.0000000",
    "activeHoursEnd": "17:00:00.0000000"
  }
}