{
  "DisplayName": "GLOBAL - BLOCK - Service Providers (Allowed Providers Excluded)",
  "State": "enabledForReportingButNotEnforced",
  "Conditions": {
    "Applications": {
      "ExcludeApplications": [],
      "IncludeApplications": [
        "All"
      ],
      "IncludeAuthenticationContextClassReferences": [],
      "IncludeUserActions": []
    },
    "ClientAppTypes": [
      "all"
    ],
    "Devices": {
      "DeviceFilter": null
    },
    "Locations": {
      "ExcludeLocations": [],
      "IncludeLocations": []
    },
    "Platforms": {
      "ExcludePlatforms": [],
      "IncludePlatforms": []
    },
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": [],
      "ExcludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "Members": [
            "7fe14ab6-8f5d-4139-84bf-cd8aed0ee6b9",
            "b12753fc-ed2c-4284-9161-4d563f9cb350"
          ],
          "MembershipKind": "enumerated"
        },
        "GuestOrExternalUserTypes": "serviceProvider"
      },
      "ExcludeRoles": [],
      "ExcludeUsers": [],
      "IncludeGroups": [],
      "IncludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": "all"
        },
        "GuestOrExternalUserTypes": "internalGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider"
      },
      "IncludeRoles": [],
      "IncludeUsers": []
    }
  },
  "GrantControls": {
    "BuiltInControls": [
      "block"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "SessionControls": {
    "ApplicationEnforcedRestrictions": null,
    "CloudAppSecurity": null,
    "PersistentBrowser": null,
    "SignInFrequency": null
  },
  "AdditionalProperties": {}
}