{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "displayName": "GLOBAL - REGISTRATION - Require MFA",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [
        "urn:user:registerdevice"
      ]
    },
    "clientAppTypes": [
      "all"
    ],
    "devices": null,
    "locations": null,
    "platforms": null,
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [],
      "excludeGuestsOrExternalUsers": {
        "externalTenants": {
          "@odata.type": "#microsoft.graph.conditionalAccessEnumeratedExternalTenants",
          "members": [
            "7fe14ab6-8f5d-4139-84bf-cd8aed0ee6b9",
            "b12753fc-ed2c-4284-9161-4d563f9cb350"
          ],
          "membershipKind": "enumerated"
        },
        "guestOrExternalUserTypes": "serviceProvider"
      },
      "excludeRoles": [
        "d29b2b05-8046-44ba-8758-1e26182fcf32"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "all"
      ]
    }
  },
  "grantControls": {
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "sessionControls": {
    "applicationEnforcedRestrictions": null,
    "cloudAppSecurity": null,
    "persistentBrowser": null,
    "signInFrequency": null
  }
}