{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "displayName": "GLOBAL - BLOCK - Service Providers (Allowed Providers Excluded)",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "all"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientApplications": null,
    "clientAppTypes": [
      "all"
    ],
    "devices": null,
    "deviceStates": null,
    "locations": null,
    "platforms": null,
    "servicePrincipalRiskLevels": [],
    "signInRiskLevels": [],
    "times": null,
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [],
      "excludeGuestsOrExternalUsers": {
        "externalTenants": {
          "@odata.type": "#microsoft.graph.conditionalAccessEnumeratedExternalTenants",
          "members": [
            "7fe14ab6-8f5d-4139-84bf-cd8aed0ee6b9",
            "b12753fc-ed2c-4284-9161-4d563f9cb350"
          ],
          "membershipKind": "enumerated"
        },
        "guestOrExternalUserTypes": "serviceProvider"
      },
      "excludeRoles": [],
      "excludeUsers": [],
      "includeGroups": [],
      "includeGuestsOrExternalUsers": {
        "externalTenants": {
          "@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants",
          "membershipKind": "all"
        },
        "guestOrExternalUserTypes": "internalGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider"
      },
      "includeRoles": [],
      "includeUsers": []
    }
  },
  "grantControls": {
    "authenticationStrength": null,
    "builtInControls": [
      "block"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "sessionControls": null
}