{
  "DisplayName": "GLOBAL - REGISTRATION - Require MFA",
  "State": "enabledForReportingButNotEnforced",
  "Conditions": {
    "Applications": {
      "ApplicationFilter": null,
      "ExcludeApplications": [],
      "IncludeApplications": [],
      "IncludeAuthenticationContextClassReferences": [],
      "IncludeUserActions": [
        "urn:user:registerdevice"
      ]
    },
    "ClientAppTypes": [
      "all"
    ],
    "ClientApplications": null,
    "DeviceStates": null,
    "Devices": null,
    "Locations": null,
    "Platforms": null,
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": [],
      "ExcludeRoles": [
        "d29b2b05-8046-44ba-8758-1e26182fcf32"
      ],
      "ExcludeUsers": [],
      "IncludeGroups": [],
      "IncludeRoles": [],
      "IncludeUsers": [
        "All"
      ]
    },
    "AdditionalProperties": {}
  },
  "GrantControls": {
    "BuiltInControls": [
      "mfa"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "SessionControls": {
    "ApplicationEnforcedRestrictions": null,
    "CloudAppSecurity": null,
    "PersistentBrowser": null,
    "SignInFrequency": null
  },
  "AdditionalProperties": {}
}