{
   "DisplayName": "GLOBAL - BLOCK - Legacy Authentication",
   "State": "enabledForReportingButNotEnforced",
   "Conditions": {
      "Applications": {
         "ExcludeApplications": [
            "0000000a-0000-0000-c000-000000000000",
            "d4ebce55-015a-49b5-a083-c84d1797ae8c"
         ],
         "IncludeApplications": [
            "All"
         ],
         "IncludeAuthenticationContextClassReferences": [],
         "IncludeUserActions": []
      },
      "ClientAppTypes": [
         "exchangeActiveSync",
         "other"
      ],
      "Devices": {
         "DeviceFilter": null
      },
      "Locations": {
         "ExcludeLocations": [],
         "IncludeLocations": [
            "All"
         ]
      },
      "Platforms": {
         "ExcludePlatforms": [],
         "IncludePlatforms": [
            "all"
         ]
      },
      "SignInRiskLevels": [],
      "UserRiskLevels": [],
      "Users": {
         "ExcludeGroups": [],
         "ExcludeRoles": [
            "d29b2b05-8046-44ba-8758-1e26182fcf32"
         ],
         "ExcludeUsers": [],
         "IncludeGroups": [],
         "IncludeRoles": [],
         "IncludeUsers": [
            "All"
         ]
      }
   },
   "GrantControls": {
      "BuiltInControls": [
         "block"
      ],
      "CustomAuthenticationFactors": [],
      "Operator": "OR",
      "TermsOfUse": []
   },
   "SessionControls": {
      "ApplicationEnforcedRestrictions": null,
      "CloudAppSecurity": null,
      "PersistentBrowser": null,
      "SignInFrequency": null
   },
   "AdditionalProperties": {}
}