{
   "DisplayName": "GLOBAL - SESSION - Disable Persistent Browser",
   "State": "enabledForReportingButNotEnforced",
   "Conditions": {
      "Applications": {
         "ExcludeApplications": [
            "0000000a-0000-0000-c000-000000000000",
            "d4ebce55-015a-49b5-a083-c84d1797ae8c"
         ],
         "IncludeApplications": [
            "All"
         ],
         "IncludeAuthenticationContextClassReferences": [],
         "IncludeUserActions": []
      },
      "ClientAppTypes": [
         "all"
      ],
      "Devices": {
         "DeviceFilter": {
            "Mode": null,
            "Rule": null
         }
      },
      "Locations": {
         "ExcludeLocations": null,
         "IncludeLocations": null
      },
      "Platforms": {
         "ExcludePlatforms": null,
         "IncludePlatforms": null
      },
      "SignInRiskLevels": [],
      "UserRiskLevels": [],
      "Users": {
         "ExcludeGroups": [],
         "ExcludeRoles": [
            "d29b2b05-8046-44ba-8758-1e26182fcf32"
         ],
         "ExcludeUsers": [],
         "IncludeGroups": [],
         "IncludeRoles": [],
         "IncludeUsers": [
            "All"
         ]
      }
   },
   "GrantControls": {
      "BuiltInControls": null,
      "CustomAuthenticationFactors": null,
      "Operator": null,
      "TermsOfUse": null
   },
   "SessionControls": {
      "ApplicationEnforcedRestrictions": null,
      "CloudAppSecurity": null,
      "PersistentBrowser": {
         "IsEnabled": true,
         "Mode": "never"
      },
      "SignInFrequency": null
   },
   "AdditionalProperties": {}
}
