{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "displayName": "GLOBAL - GRANT - Allowed Service Providers (Require MFA)",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "all"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientApplications": null,
    "clientAppTypes": [
      "all"
    ],
    "devices": null,
    "deviceStates": null,
    "locations": null,
    "platforms": null,
    "servicePrincipalRiskLevels": [],
    "signInRiskLevels": [],
    "times": null,
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [],
      "excludeGuestsOrExternalUsers": null,
      "excludeRoles": [],
      "excludeUsers": [],
      "includeGroups": [],
      "includeGuestsOrExternalUsers": {
        "externalTenants": {
          "@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants",
          "membershipKind": "all"
        },
        "guestOrExternalUserTypes": "serviceProvider"
      },
      "includeRoles": [],
      "includeUsers": []
    }
  },
  "grantControls": {
    "authenticationStrength": null,
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "sessionControls": null
}