{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "displayName": "PREVIEW - BLOCK - Disallowed Countries (exclude iOS)",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "applications": {
      "excludeApplications": [
        "0000000a-0000-0000-c000-000000000000"
      ],
      "includeApplications": [
        "all"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "all"
    ],
    "devices": null,
    "locations": {
      "excludeLocations": [],
      "includeLocations": [
        "all"
      ]
    },
    "platforms": {
      "excludePlatforms": [
        "iOS"
      ],
      "includePlatforms": [
        "all"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "includeGroups": [],
      "excludeRoles": [
        "d29b2b05-8046-44ba-8758-1e26182fcf32"
      ],
      "excludeUsers": [],
      "includeRoles": [],
      "excludeGroups": [],
      "excludeGuestsOrExternalUsers": {
        "externalTenants": {
          "@odata.type": "#microsoft.graph.conditionalAccessEnumeratedExternalTenants",
          "members": [
            "7fe14ab6-8f5d-4139-84bf-cd8aed0ee6b9",
            "b12753fc-ed2c-4284-9161-4d563f9cb350"
          ],
          "membershipKind": "enumerated"
        },
        "guestOrExternalUserTypes": "serviceProvider"
      },
      "includeUsers": []
    }
  },
  "grantControls": {
    "builtInControls": [
      "block"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "sessionControls": {
    "applicationEnforcedRestrictions": null,
    "cloudAppSecurity": null,
    "persistentBrowser": null,
    "signInFrequency": null
  }
}