{
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "autoInstallAtMaintenanceTime",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "qualityUpdatesDeferralPeriodInDays": 0,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "businessReadyUpdatesOnly": "windowsInsiderBuildRelease",
    "skipChecksBeforeRestart": false,
    "featureUpdatesRollbackWindowInDays": 60,
    "qualityUpdatesWillBeRolledBack": false,
    "featureUpdatesWillBeRolledBack": false,
    "deadlineForFeatureUpdatesInDays": 7,
    "deadlineForQualityUpdatesInDays": 7,
    "deadlineGracePeriodInDays": 2,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "userPauseAccess": "enabled",
    "userWindowsUpdateScanAccess": "enabled",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": true,
    "installationSchedule": {
        "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
        "activeHoursStart": "07:00:00.0000000",
        "activeHoursEnd": "19:00:00.0000000"
    }
}