{
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "f6568e85-767e-4e39-8221-b202eed22432",
    "lastModifiedDateTime": "2022-11-18T14:48:13.9434931Z",
    "roleScopeTagIds": [
        "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2022-11-18T14:48:13.9434931Z",
    "description": "",
    "displayName": "Windows 10 - Insider",
    "version": 1,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "autoInstallAtMaintenanceTime",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "qualityUpdatesDeferralPeriodInDays": 0,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "windowsInsiderBuildRelease",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 60,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 2,
    "deadlineForQualityUpdatesInDays": 2,
    "deadlineGracePeriodInDays": 7,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "enabled",
    "userWindowsUpdateScanAccess": "enabled",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "installationSchedule": {
        "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
        "activeHoursStart": "07:00:00.0000000",
        "activeHoursEnd": "19:00:00.0000000"
    },
    "groupAssignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027f6568e85-767e-4e39-8221-b202eed22432\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/groupAssignments",
    "groupAssignments": []
}