{
  "@odata.type": "#microsoft.graph.windowsHealthMonitoringConfiguration",
  "displayName": "Data Collection",
  "description": "Data collection required for Endpoint Analytics and Windows Updates",
  "version": 1,
  "allowDeviceHealthMonitoring": "enabled",
  "configDeviceHealthMonitoringScope": "bootPerformance,windowsUpdates"
}