{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "displayName": "Microsoft Defender Tamper Protection",
  "description": "Controls Microsoft Tamper Protection for Microsoft Defender",
  "version": 1,
  "windowsDefenderTamperProtection": "enable"
}