{
   "@odata.type": "#microsoft.graph.androidDeviceOwnerCompliancePolicy",
   "description": null,
   "displayName": "Android Corporate (E5)",
   "version": 1,
   "deviceThreatProtectionEnabled": true,
   "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
   "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
   "securityRequireSafetyNetAttestationBasicIntegrity": true,
   "securityRequireSafetyNetAttestationCertifiedDevice": true,
   "osMinimumVersion": "10",
   "osMaximumVersion": null,
   "minAndroidSecurityPatchLevel": null,
   "passwordRequired": true,
   "passwordMinimumLength": 6,
   "passwordMinimumLetterCharacters": null,
   "passwordMinimumLowerCaseCharacters": null,
   "passwordMinimumNonLetterCharacters": null,
   "passwordMinimumNumericCharacters": null,
   "passwordMinimumSymbolCharacters": null,
   "passwordMinimumUpperCaseCharacters": null,
   "passwordRequiredType": "numeric",
   "passwordMinutesOfInactivityBeforeLock": 5,
   "passwordExpirationDays": null,
   "passwordPreviousPasswordCountToBlock": null,
   "storageRequireEncryption": true,
   "securityRequireIntuneAppIntegrity": true
}