{
   "@odata.type": "#microsoft.graph.androidDeviceOwnerCompliancePolicy",
   "description": null,
   "displayName": "Android Corporate (E5)",
   "version": 1,
   "deviceThreatProtectionEnabled": true,
   "deviceThreatProtectionRequiredSecurityLevel": "high",
   "advancedThreatProtectionRequiredSecurityLevel": "high",
   "securityRequireSafetyNetAttestationBasicIntegrity": false,
   "securityRequireSafetyNetAttestationCertifiedDevice": false,
   "osMinimumVersion": null,
   "osMaximumVersion": null,
   "minAndroidSecurityPatchLevel": null,
   "passwordRequired": true,
   "passwordMinimumLength": 4,
   "passwordMinimumLetterCharacters": null,
   "passwordMinimumLowerCaseCharacters": null,
   "passwordMinimumNonLetterCharacters": null,
   "passwordMinimumNumericCharacters": null,
   "passwordMinimumSymbolCharacters": null,
   "passwordMinimumUpperCaseCharacters": null,
   "passwordRequiredType": "numeric",
   "passwordMinutesOfInactivityBeforeLock": null,
   "passwordExpirationDays": null,
   "passwordPreviousPasswordCountToBlock": null,
   "storageRequireEncryption": false
}