{
    "@odata.type":  "#microsoft.graph.androidWorkProfileCompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "277a1b01-c02c-4c92-b2bb-f88853a84e1d",
    "createdDateTime":  "2022-05-16T16:04:38.6708458Z",
    "description":  null,
    "lastModifiedDateTime":  "2022-07-21T07:45:48.2674754Z",
    "displayName":  "Android BYOD",
    "version":  2,
    "passwordRequired":  true,
    "passwordMinimumLength":  4,
    "passwordRequiredType":  "numeric",
    "passwordMinutesOfInactivityBeforeLock":  null,
    "passwordExpirationDays":  null,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordSignInFailureCountBeforeFactoryReset":  null,
    "securityPreventInstallAppsFromUnknownSources":  true,
    "securityDisableUsbDebugging":  false,
    "securityRequireVerifyApps":  false,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel":  "unavailable",
    "securityBlockJailbrokenDevices":  true,
    "osMinimumVersion":  "10",
    "osMaximumVersion":  null,
    "minAndroidSecurityPatchLevel":  null,
    "storageRequireEncryption":  true,
    "securityRequireSafetyNetAttestationBasicIntegrity":  false,
    "securityRequireSafetyNetAttestationCertifiedDevice":  false,
    "securityRequireGooglePlayServices":  false,
    "securityRequireUpToDateSecurityProviders":  false,
    "securityRequireCompanyPortalAppIntegrity":  true,
    "securityRequiredAndroidSafetyNetEvaluationType":  "basic"
}
