{
   "@odata.type": "#microsoft.graph.androidWorkProfileCompliancePolicy",
   "description": null,
   "displayName": "Android BYOD",
   "version": 1,
   "passwordRequired": true,
   "passwordMinimumLength": 6,
   "passwordRequiredType": "numeric",
   "passwordMinutesOfInactivityBeforeLock": 5,
   "passwordExpirationDays": null,
   "passwordPreviousPasswordBlockCount": null,
   "passwordSignInFailureCountBeforeFactoryReset": null,
   "deviceThreatProtectionEnabled": false,
   "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
   "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
   "osMinimumVersion": "10",
   "osMaximumVersion": null,
   "minAndroidSecurityPatchLevel": null,
   "storageRequireEncryption": true,
   "securityBlockJailbrokenDevices": true,
   "securityDisableUsbDebugging": false,
   "securityPreventInstallAppsFromUnknownSources": true,
   "securityRequireSafetyNetAttestationBasicIntegrity": true,
   "securityRequireSafetyNetAttestationCertifiedDevice": true,
   "securityRequireGooglePlayServices": true,
   "securityRequireUpToDateSecurityProviders": true,
   "securityRequireCompanyPortalAppIntegrity": true,
   "securityRequireVerifyApps": false,
   "securityRequiredAndroidSafetyNetEvaluationType": "basic"
}