{
   "@odata.type": "#microsoft.graph.iosCompliancePolicy",
   "description": null,
   "displayName": "iOS/iPad - Corporate",
   "version": 1,
   "passcodeBlockSimple": true,
   "passcodeExpirationDays": null,
   "passcodeMinimumLength": 6,
   "passcodeMinutesOfInactivityBeforeLock": 0,
   "passcodeMinutesOfInactivityBeforeScreenTimeout": 5,
   "passcodePreviousPasscodeBlockCount": null,
   "passcodeMinimumCharacterSetCount": null,
   "passcodeRequiredType": "numeric",
   "passcodeRequired": true,
   "osMinimumVersion": "13",
   "osMaximumVersion": null,
   "osMinimumBuildVersion": null,
   "osMaximumBuildVersion": null,
   "securityBlockJailbrokenDevices": true,
   "deviceThreatProtectionEnabled": true,
   "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
   "advancedThreatProtectionRequiredSecurityLevel": "low",
   "managedEmailProfileRequired": false,
   "restrictedApps": []
}