{
   "@odata.type": "#microsoft.graph.iosCompliancePolicy",
   "description": null,
   "displayName": "iOS/iPad - Personal",
   "version": 1,
   "passcodeBlockSimple": false,
   "passcodeExpirationDays": null,
   "passcodeMinimumLength": null,
   "passcodeMinutesOfInactivityBeforeLock": null,
   "passcodeMinutesOfInactivityBeforeScreenTimeout": 5,
   "passcodePreviousPasscodeBlockCount": null,
   "passcodeMinimumCharacterSetCount": null,
   "passcodeRequiredType": "deviceDefault",
   "passcodeRequired": false,
   "osMinimumVersion": "13",
   "osMaximumVersion": null,
   "osMinimumBuildVersion": null,
   "osMaximumBuildVersion": null,
   "securityBlockJailbrokenDevices": true,
   "deviceThreatProtectionEnabled": false,
   "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
   "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
   "managedEmailProfileRequired": false,
   "restrictedApps": []
}