{
    "@odata.type":  "#microsoft.graph.iosCompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "fd457084-b2d1-4b24-aef8-bd83b81bff5e",
    "createdDateTime":  "2022-05-16T15:55:44.5788646Z",
    "description":  null,
    "lastModifiedDateTime":  "2022-07-21T08:50:01.8472451Z",
    "displayName":  "iOS/iPad - Personal",
    "version":  4,
    "passcodeBlockSimple":  false,
    "passcodeExpirationDays":  null,
    "passcodeMinimumLength":  null,
    "passcodeMinutesOfInactivityBeforeLock":  null,
    "passcodeMinutesOfInactivityBeforeScreenTimeout":  null,
    "passcodePreviousPasscodeBlockCount":  null,
    "passcodeMinimumCharacterSetCount":  null,
    "passcodeRequiredType":  "deviceDefault",
    "passcodeRequired":  false,
    "osMinimumVersion":  "13",
    "osMaximumVersion":  null,
    "osMinimumBuildVersion":  null,
    "osMaximumBuildVersion":  null,
    "securityBlockJailbrokenDevices":  true,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel":  "unavailable",
    "managedEmailProfileRequired":  false,
    "restrictedApps":  [

                       ]
}
