{
    "@odata.type":  "#microsoft.graph.macOSCompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "dfd1d879-609e-448d-bca2-4e04a2aae803",
    "createdDateTime":  "2022-05-16T14:51:34.5096474Z",
    "description":  null,
    "lastModifiedDateTime":  "2022-05-16T15:56:32.0705445Z",
    "displayName":  "macOS Corporate",
    "version":  2,
    "passwordRequired":  false,
    "passwordBlockSimple":  false,
    "passwordExpirationDays":  null,
    "passwordMinimumLength":  null,
    "passwordMinutesOfInactivityBeforeLock":  null,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordMinimumCharacterSetCount":  null,
    "passwordRequiredType":  "deviceDefault",
    "osMinimumVersion":  "10.15",
    "osMaximumVersion":  null,
    "osMinimumBuildVersion":  null,
    "osMaximumBuildVersion":  null,
    "systemIntegrityProtectionEnabled":  true,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel":  "unavailable",
    "storageRequireEncryption":  false,
    "gatekeeperAllowedAppSource":  "macAppStore",
    "firewallEnabled":  true,
    "firewallBlockAllIncoming":  false,
    "firewallEnableStealthMode":  false
}
