{
   "@odata.type": "#microsoft.graph.macOSCompliancePolicy",
   "description": null,
   "displayName": "macOS BYOD",
   "version": 1,
   "passwordRequired": false,
   "passwordBlockSimple": false,
   "passwordExpirationDays": null,
   "passwordMinimumLength": null,
   "passwordMinutesOfInactivityBeforeLock": null,
   "passwordPreviousPasswordBlockCount": null,
   "passwordMinimumCharacterSetCount": null,
   "passwordRequiredType": "deviceDefault",
   "osMinimumVersion": "11.7",
   "osMaximumVersion": null,
   "osMinimumBuildVersion": null,
   "osMaximumBuildVersion": null,
   "systemIntegrityProtectionEnabled": false,
   "deviceThreatProtectionEnabled": false,
   "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
   "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
   "storageRequireEncryption": false,
   "gatekeeperAllowedAppSource": "notConfigured",
   "firewallEnabled": true,
   "firewallBlockAllIncoming": false,
   "firewallEnableStealthMode": false
}