{
   "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
   "description": null,
   "displayName": "Windows 10 Corporate (E5)",
   "version": 1,
   "passwordRequired": true,
   "passwordBlockSimple": false,
   "passwordRequiredToUnlockFromIdle": false,
   "passwordMinutesOfInactivityBeforeLock": null,
   "passwordExpirationDays": null,
   "passwordMinimumLength": null,
   "passwordMinimumCharacterSetCount": null,
   "passwordRequiredType": "deviceDefault",
   "passwordPreviousPasswordBlockCount": null,
   "requireHealthyDeviceReport": false,
   "osMinimumVersion": "10.0.18363.1593",
   "osMaximumVersion": null,
   "mobileOsMinimumVersion": null,
   "mobileOsMaximumVersion": null,
   "earlyLaunchAntiMalwareDriverEnabled": false,
   "bitLockerEnabled": false,
   "secureBootEnabled": false,
   "codeIntegrityEnabled": false,
   "storageRequireEncryption": false,
   "activeFirewallRequired": false,
   "defenderEnabled": false,
   "defenderVersion": null,
   "signatureOutOfDate": false,
   "rtpEnabled": false,
   "antivirusRequired": false,
   "antiSpywareRequired": false,
   "deviceThreatProtectionEnabled": true,
   "deviceThreatProtectionRequiredSecurityLevel": "low",
   "configurationManagerComplianceRequired": false,
   "tpmRequired": false,
   "deviceCompliancePolicyScript": null,
   "validOperatingSystemBuildRanges": []
}