{
   "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
   "description": null,
   "displayName": "Windows 11 Corporate",
   "version": 1,
   "passwordRequired": false,
   "passwordBlockSimple": false,
   "passwordRequiredToUnlockFromIdle": false,
   "passwordMinutesOfInactivityBeforeLock": null,
   "passwordExpirationDays": null,
   "passwordMinimumLength": null,
   "passwordMinimumCharacterSetCount": null,
   "passwordRequiredType": "deviceDefault",
   "passwordPreviousPasswordBlockCount": null,
   "requireHealthyDeviceReport": false,
   "osMinimumVersion": "10.0.22000.739",
   "osMaximumVersion": null,
   "mobileOsMinimumVersion": null,
   "mobileOsMaximumVersion": null,
   "earlyLaunchAntiMalwareDriverEnabled": false,
   "bitLockerEnabled": false,
   "secureBootEnabled": false,
   "codeIntegrityEnabled": false,
   "storageRequireEncryption": false,
   "activeFirewallRequired": true,
   "defenderEnabled": true,
   "defenderVersion": null,
   "signatureOutOfDate": true,
   "rtpEnabled": true,
   "antivirusRequired": true,
   "antiSpywareRequired": true,
   "deviceThreatProtectionEnabled": true,
   "deviceThreatProtectionRequiredSecurityLevel": "low",
   "configurationManagerComplianceRequired": false,
   "tpmRequired": true,
   "deviceCompliancePolicyScript": null,
   "validOperatingSystemBuildRanges": []
}