{
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "description": null,
  "displayName": "Windows BYOD",
  "version": 1,
  "passwordRequired": false,
  "passwordBlockSimple": false,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordRequiredType": "deviceDefault",
  "passwordPreviousPasswordBlockCount": null,
  "requireHealthyDeviceReport": false,
  "osMinimumVersion": "10.0.19044.2075",
  "osMaximumVersion": null,
  "mobileOsMinimumVersion": null,
  "mobileOsMaximumVersion": null,
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "bitLockerEnabled": false,
  "secureBootEnabled": false,
  "codeIntegrityEnabled": false,
  "storageRequireEncryption": false,
  "activeFirewallRequired": true,
  "defenderEnabled": false,
  "defenderVersion": null,
  "signatureOutOfDate": false,
  "rtpEnabled": false,
  "antivirusRequired": true,
  "antiSpywareRequired": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "configurationManagerComplianceRequired": false,
  "tpmRequired": false,
  "deviceCompliancePolicyScript": null,
  "validOperatingSystemBuildRanges": []
}