{
    "@odata.type":  "#microsoft.graph.windows10CompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "fbe39ad4-4c43-4c0b-a62e-a551ab757764",
    "createdDateTime":  "2022-05-16T14:47:34.1867236Z",
    "description":  null,
    "lastModifiedDateTime":  "2022-08-17T10:11:06.8215457Z",
    "displayName":  "Windows 10 Corporate",
    "version":  10,
    "passwordRequired":  false,
    "passwordBlockSimple":  false,
    "passwordRequiredToUnlockFromIdle":  false,
    "passwordMinutesOfInactivityBeforeLock":  null,
    "passwordExpirationDays":  null,
    "passwordMinimumLength":  null,
    "passwordMinimumCharacterSetCount":  null,
    "passwordRequiredType":  "deviceDefault",
    "passwordPreviousPasswordBlockCount":  null,
    "requireHealthyDeviceReport":  false,
    "osMinimumVersion":  "10.0.19044.1706",
    "osMaximumVersion":  null,
    "mobileOsMinimumVersion":  null,
    "mobileOsMaximumVersion":  null,
    "earlyLaunchAntiMalwareDriverEnabled":  false,
    "bitLockerEnabled":  false,
    "secureBootEnabled":  false,
    "codeIntegrityEnabled":  false,
    "storageRequireEncryption":  true,
    "activeFirewallRequired":  true,
    "defenderEnabled":  true,
    "defenderVersion":  null,
    "signatureOutOfDate":  true,
    "rtpEnabled":  true,
    "antivirusRequired":  true,
    "antiSpywareRequired":  true,
    "deviceThreatProtectionEnabled":  true,
    "deviceThreatProtectionRequiredSecurityLevel":  "low",
    "configurationManagerComplianceRequired":  false,
    "tpmRequired":  true,
    "deviceCompliancePolicyScript":  null,
    "validOperatingSystemBuildRanges":  [

                                        ]
}
