{
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "1d2c9b1c-de2f-4c0e-b053-a2f68d197dd2",
  "createdDateTime": "2021-01-26T14:58:58.4930073Z",
  "description": null,
  "lastModifiedDateTime": "2021-01-28T14:31:14.5232605Z",
  "displayName": "Windows 10 Corporate (E5)",
  "version": 4,
  "passwordRequired": true,
  "passwordBlockSimple": false,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordRequiredType": "deviceDefault",
  "passwordPreviousPasswordBlockCount": null,
  "requireHealthyDeviceReport": false,
  "osMinimumVersion": "10.0.18363.1593",
  "osMaximumVersion": null,
  "mobileOsMinimumVersion": null,
  "mobileOsMaximumVersion": null,
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "bitLockerEnabled": false,
  "secureBootEnabled": false,
  "codeIntegrityEnabled": false,
  "storageRequireEncryption": false,
  "activeFirewallRequired": false,
  "defenderEnabled": false,
  "defenderVersion": null,
  "signatureOutOfDate": false,
  "rtpEnabled": false,
  "antivirusRequired": false,
  "antiSpywareRequired": false,
  "deviceThreatProtectionEnabled": true,
  "deviceThreatProtectionRequiredSecurityLevel": "low",
  "configurationManagerComplianceRequired": false,
  "tpmRequired": false,
  "deviceCompliancePolicyScript": null,
  "validOperatingSystemBuildRanges": [

  ]
}
