{
   "SessionControls": {
      "CloudAppSecurity": null,
      "PersistentBrowser": null,
      "SignInFrequency": null,
      "ApplicationEnforcedRestrictions": null
   },
   "DisplayName": "GLOBAL - BLOCK - Disallowed Countries",
   "GrantControls": {
      "Operator": "OR",
      "BuiltInControls": [
         "block"
      ],
      "TermsOfUse": [],
      "CustomAuthenticationFactors": []
   },
   "Conditions": {
      "ClientAppTypes": [
         "All"
      ],
      "SignInRiskLevels": [],
      "Applications": {
         "ExcludeApplications": "",
         "IncludeApplications": "All",
         "IncludeUserActions": ""
      },
      "Users": {
         "IncludeGroups": "",
         "ExcludeRoles": "d29b2b05-8046-44ba-8758-1e26182fcf32",
         "ExcludeUsers": "<excludeUsers>",
         "IncludeRoles": "",
         "ExcludeGroups": "<excludeGroups>",
         "IncludeUsers": "All"
      },
      "Locations": {
         "IncludeLocations": "All",
         "ExcludeLocations": "<excludeLocations>"
      },
      "Platforms": {
         "IncludePlatforms": "all",
         "ExcludePlatforms": ""
      }
   },
   "State": "enabledForReportingButNotEnforced"
}
