{
  "displayName": "Microsoft Enterprise SSO Plug-In",
  "description": "Microsoft Enterprise SSO Plug-In",
  "version": 1,
  "@odata.type": "#microsoft.graph.macOSDeviceFeaturesConfiguration",
  "macOSSingleSignOnExtension": {
    "@odata.type": "#microsoft.graph.macOSAzureAdSingleSignOnExtension",
    "enableSharedDeviceMode": false,
    "bundleIdAccessControlList": [],
    "configurations": [
      {
        "@odata.type": "#microsoft.graph.keyStringValuePair",
        "key": "AppPrefixAllowList",
        "value": "com.microsoft."
      },
      {
        "@odata.type": "#microsoft.graph.keyIntegerValuePair",
        "key": "browser_sso_interaction_enabled",
        "value": 1
      },
      {
        "@odata.type": "#microsoft.graph.keyIntegerValuePair",
        "key": "browser_sso_disable_mfa",
        "value": 0
      },
      {
        "@odata.type": "#microsoft.graph.keyIntegerValuePair",
        "key": "disable_explicit_app_prompt",
        "value": 1
      }
    ]
  }
}