{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "displayName": "Application Control",
  "description": null,
  "version": 1,
  "smartScreenBlockOverrideForFiles": true,
  "smartScreenEnableInShell": true
}