{
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "displayName": "Custom Settings",
  "description": null,
  "version": 1,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingBoolean",
      "description": "Disable Enrollment Status Page post Build",
      "displayName": "Disable Device ESP",
      "isEncrypted": false,
      "omaUri": "./Vendor/MSFT/DMClient/Provider/MS DM Server/FirstSyncStatus/SkipDeviceStatusPage",
      "secretReferenceValueId": null,
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingBoolean",
      "description": "Disable Enrollment Status Page post Build",
      "displayName": "Disable User ESP",
      "isEncrypted": false,
      "omaUri": "./Vendor/MSFT/DMClient/Provider/MS DM Server/FirstSyncStatus/SkipUserStatusPage",
      "secretReferenceValueId": null,
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "description": "AllowAdvancedGamingServices",
      "displayName": "Games/AllowAdvancedGamingServices",
      "isEncrypted": false,
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Games/AllowAdvancedGamingServices",
      "secretReferenceValueId": null,
      "value": 0
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "description": "AllowIndexingEncryptedStoresOrItems",
      "displayName": "Search/AllowIndexingEncryptedStoresOrItems",
      "isEncrypted": false,
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Search/AllowIndexingEncryptedStoresOrItems",
      "secretReferenceValueId": null,
      "value": 0
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "description": "ConfigureSystemGuardLaunch",
      "displayName": "ConfigureSystemGuardLaunch",
      "isEncrypted": false,
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/DeviceGuard/ConfigureSystemGuardLaunch",
      "secretReferenceValueId": null,
      "value": 1
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "description": "Disable first sign-in animation",
      "displayName": "Disable first sign-in animation",
      "isEncrypted": false,
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/WindowsLogon/EnableFirstLogonAnimation",
      "secretReferenceValueId": null,
      "value": 0
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "description": "EnableInsecureGuestLogons",
      "displayName": "LanmanWorkstation/EnableInsecureGuestLogons",
      "isEncrypted": false,
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/LanmanWorkstation/EnableInsecureGuestLogons",
      "secretReferenceValueId": null,
      "value": 0
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "description": "Network Isolation - Enterprise Proxy Servers Are Authoritative",
      "displayName": "Network Isolation - Enterprise Proxy Servers Are Authoritative",
      "isEncrypted": false,
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/NetworkIsolation/EnterpriseProxyServersAreAuthoritative",
      "secretReferenceValueId": null,
      "value": 1
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-controlpolicyconflict",
      "displayName": "MDMWinsOverGP",
      "isEncrypted": false,
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/ControlPolicyConflict/MDMWinsOverGP",
      "secretReferenceValueId": null,
      "value": 1
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-privacy#privacy-letappsactivatewithvoiceabovelock",
      "displayName": "Privacy/LetAppsActivateWithVoiceAboveLock",
      "isEncrypted": false,
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Privacy/LetAppsActivateWithVoiceAboveLock",
      "secretReferenceValueId": null,
      "value": 2
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "description": "more control over the enumeration of external DMA capable devices incompatible with DMA Remapping/device memory isolation and sandboxing.",
      "displayName": "DmaGuard/DeviceEnumerationPolicy",
      "isEncrypted": false,
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/DmaGuard/DeviceEnumerationPolicy",
      "secretReferenceValueId": null,
      "value": 0
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "AllowICMPRedirectsToOverrideOSPFGeneratedRoutes",
      "displayName": "MSSLegacy/AllowICMPRedirectsToOverrideOSPFGeneratedRoutes",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSLegacy/AllowICMPRedirectsToOverrideOSPFGeneratedRoutes",
      "secretReferenceValueId": null,
      "value": "<disabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "AllowTheComputerToIgnoreNetBIOSNameReleaseRequestsExceptFromWINSServers",
      "displayName": "MSSLegacy/AllowTheComputerToIgnoreNetBIOSNameReleaseRequestsExceptFromWINSServers",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSLegacy/AllowTheComputerToIgnoreNetBIOSNameReleaseRequestsExceptFromWINSServers",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "ApplyUACRestrictionsToLocalAccountsOnNetworkLogon",
      "displayName": "MSSecurityGuide/ApplyUACRestrictionsToLocalAccountsOnNetworkLogon",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSecurityGuide/ApplyUACRestrictionsToLocalAccountsOnNetworkLogon",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "Autoplay/SetDefaultAutoRunBehavior",
      "displayName": "Autoplay/SetDefaultAutoRunBehavior",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Autoplay/SetDefaultAutoRunBehavior",
      "secretReferenceValueId": null,
      "value": "<enabled/>\n<data id=\"NoAutorun_Dropdown\" value=\"1\"/>\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "BootStartDriverInitialization",
      "displayName": "System/BootStartDriverInitialization",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/System/BootStartDriverInitialization",
      "secretReferenceValueId": null,
      "value": "<enabled/>\n<data id=\"SelectDriverLoadPolicy\" value=\"3\"/>\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "ClientConnectionEncryptionLevel",
      "displayName": "RemoteDesktopServices/ClientConnectionEncryptionLevel",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteDesktopServices/ClientConnectionEncryptionLevel",
      "secretReferenceValueId": null,
      "value": "<enabled/>\n<data id=\"TS_ENCRYPTION_LEVEL\" value=\"3\"/>\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "ConfigureSMBV1ClientDriver",
      "displayName": "MSSecurityGuide/ConfigureSMBV1ClientDriver",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSecurityGuide/ConfigureSMBV1ClientDriver",
      "secretReferenceValueId": null,
      "value": "<enabled/> \n<data id=\"Pol_SecGuide_SMB1ClientDriver\" value=\"4\"/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "ConfigureSMBV1Server",
      "displayName": "MSSecurityGuide/ConfigureSMBV1Server",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSecurityGuide/ConfigureSMBV1Server",
      "secretReferenceValueId": null,
      "value": "<disabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "DisallowAutoplayForNonVolumeDevices",
      "displayName": "AutoPlay/DisallowAutoplayForNonVolumeDevices",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/AutoPlay/DisallowAutoplayForNonVolumeDevices",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "DoNotAllowDriveRedirection",
      "displayName": "RemoteDesktopServices/DoNotAllowDriveRedirection",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteDesktopServices/DoNotAllowDriveRedirection",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "Error Reporting - Disable Windows Error Reporting",
      "displayName": "Error Reporting - Disable Windows Error Reporting",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/ErrorReporting/DisableWindowsErrorReporting",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "IPSourceRoutingProtectionLevel",
      "displayName": "MSSLegacy/IPSourceRoutingProtectionLevel",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSLegacy/IPSourceRoutingProtectionLevel",
      "secretReferenceValueId": null,
      "value": "<enabled/> \n<data id=\"DisableIPSourceRouting\" value=\"2\"/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "IPv6SourceRoutingProtectionLevel",
      "displayName": "MSSLegacy/IPv6SourceRoutingProtectionLevel",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSLegacy/IPv6SourceRoutingProtectionLevel",
      "secretReferenceValueId": null,
      "value": "<enabled/> \n<data id=\"DisableIPSourceRoutingIPv6\" value=\"2\"/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "MSSecurityGuide/EnableStructuredExceptionHandlingOverwriteProtection",
      "displayName": "MSSecurityGuide/EnableStructuredExceptionHandlingOverwriteProtection",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSecurityGuide/EnableStructuredExceptionHandlingOverwriteProtection",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "PreventInstallationOfMatchingDeviceIDs",
      "displayName": "DeviceInstallation/PreventInstallationOfMatchingDeviceIDs",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/DeviceInstallation/PreventInstallationOfMatchingDeviceIDs",
      "secretReferenceValueId": null,
      "value": "<enabled/>\n<data id=\"DeviceInstall_IDs_Deny_Retroactive\" value=\"true\"/>\n<data id=\"DeviceInstall_IDs_Deny_List\" value=\"1&#xF000;PCI\\CC_0C0A\"/>\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "PreventInstallationOfMatchingDeviceSetupClasses",
      "displayName": "DeviceInstallation/PreventInstallationOfMatchingDeviceSetupClasses",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/DeviceInstallation/PreventInstallationOfMatchingDeviceSetupClasses",
      "secretReferenceValueId": null,
      "value": "<enabled/>\n<data id=\"DeviceInstall_Classes_Deny_Retroactive\" value=\"true\"/>\n<Data id=\"DeviceInstall_Classes_Deny_List\" value=\"1&#xF000;d48179be-ec20-11d1-b6b8-00c04fa372a7&#xF000;2&#xF000;7ebefbc0-3200-11d2-b4c2-00a0C9697d07&#xF000;3&#xF000;c06ff265-ae09-48f0-812c-16753d7cba83&#xF000;4&#xF000;6bdd1fc1-810f-11d0-bec7-08002be2092f\"/>\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "PreventLockScreenSlideShow",
      "displayName": "DeviceLock/PreventLockScreenSlideShow",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/DeviceLock/PreventLockScreenSlideShow",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "PromptForPasswordUponConnection",
      "displayName": "RemoteDesktopServices/PromptForPasswordUponConnection",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteDesktopServices/PromptForPasswordUponConnection",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "RemoteProcedureCall/RestrictUnauthenticatedRPCClients",
      "displayName": "RemoteProcedureCall/RestrictUnauthenticatedRPCClients",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteProcedureCall/RestrictUnauthenticatedRPCClients",
      "secretReferenceValueId": null,
      "value": "<enabled/>\n<data id=\"RpcRestrictRemoteClientsList\" value=\"1\"/>\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "RequireSecureRPCCommunication",
      "displayName": "RemoteDesktopServices/RequireSecureRPCCommunication",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteDesktopServices/RequireSecureRPCCommunication",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "SolicitedRemoteAssistance",
      "displayName": "RemoteAssistance/SolicitedRemoteAssistance",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteAssistance/SolicitedRemoteAssistance",
      "secretReferenceValueId": null,
      "value": "<disabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "TurnOffAutoPlay",
      "displayName": "Autoplay/TurnOffAutoPlay",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Autoplay/TurnOffAutoPlay",
      "secretReferenceValueId": null,
      "value": "<enabled/>\n<data id=\"Autorun_Box\" value=\"255\" />\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "WDigestAuthentication",
      "displayName": "MSSecurityGuide/WDigestAuthentication",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSecurityGuide/WDigestAuthentication",
      "secretReferenceValueId": null,
      "value": "<disabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-Connectivity#connectivity-prohibitinstallationandconfigurationofnetworkbridge",
      "displayName": "Connectivity/ProhibitInstallationAndConfigurationOfNetworkBridge",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Connectivity/ProhibitInstallationAndConfigurationOfNetworkBridge",
      "secretReferenceValueId": null,
      "value": "<enabled />"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-appruntime#appruntime-allowmicrosoftaccountstobeoptional",
      "displayName": "AppRuntime/AllowMicrosoftAccountsToBeOptional",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/AppRuntime/AllowMicrosoftAccountsToBeOptional",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-connectivity#connectivity-disabledownloadingofprintdriversoverhttp",
      "displayName": "Connectivity/DisableDownloadingOfPrintDriversOverHTTP",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Connectivity/DisableDownloadingOfPrintDriversOverHTTP",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-connectivity#connectivity-disableinternetdownloadforwebpublishingandonlineorderingwizards",
      "displayName": "Connectivity/DisableInternetDownloadForWebPublishingAndOnlineOrderingWizards",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Connectivity/DisableInternetDownloadForWebPublishingAndOnlineOrderingWizards",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-connectivity#connectivity-hardeneduncpaths",
      "displayName": "Connectivity/HardenedUNCPaths",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Connectivity/HardenedUNCPaths",
      "secretReferenceValueId": null,
      "value": "<enabled /><data id=\"Pol_HardenedPaths\" value=\"\\\\*\\SYSVOL&#xF000;RequireMutualAuthentication=1,RequireIntegrity=1&#xF000;\\\\*\\NETLOGON&#xF000;RequireMutualAuthentication=1,RequireIntegrity=1\" />"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-credentialsdelegation#credentialsdelegation-remotehostallowsdelegationofnonexportablecredentials",
      "displayName": "CredentialsDelegation/RemoteHostAllowsDelegationOfNonExportableCredentials",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/CredentialsDelegation/RemoteHostAllowsDelegationOfNonExportableCredentials",
      "secretReferenceValueId": null,
      "value": "<enabled />"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-eventlogservice#eventlogservice-specifymaximumfilesizesecuritylog",
      "displayName": "EventLogService/SpecifyMaximumFileSizeSecurityLog",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/EventLogService/SpecifyMaximumFileSizeSecurityLog",
      "secretReferenceValueId": null,
      "value": "<enabled /><data id=\"Channel_LogMaxSize\" value=\"196608\" />"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-fileexplorer#fileexplorer-turnoffdataexecutionpreventionforexplorer",
      "displayName": "FileExplorer/TurnOffDataExecutionPreventionForExplorer",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/FileExplorer/TurnOffDataExecutionPreventionForExplorer",
      "secretReferenceValueId": null,
      "value": "<disabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-fileexplorer#fileexplorer-turnoffheapterminationoncorruption",
      "displayName": "FileExplorer/TurnOffHeapTerminationOnCorruption",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/FileExplorer/TurnOffHeapTerminationOnCorruption",
      "secretReferenceValueId": null,
      "value": "<disabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-power#power-allowstandbystateswhensleepingonbattery",
      "displayName": "Power/AllowStandbyStatesWhenSleepingOnBattery",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Power/AllowStandbyStatesWhenSleepingOnBattery",
      "secretReferenceValueId": null,
      "value": "<disabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-power#power-allowstandbywhensleepingpluggedin",
      "displayName": "Power/AllowStandbyWhenSleepingPluggedIn",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Power/AllowStandbyWhenSleepingPluggedIn",
      "secretReferenceValueId": null,
      "value": "<disabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotedesktopservices#remotedesktopservices-donotallowpasswordsaving",
      "displayName": "RemoteDesktopServices/DoNotAllowPasswordSaving",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteDesktopServices/DoNotAllowPasswordSaving",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotemanagement#remotemanagement-allowbasicauthentication-client",
      "displayName": "RemoteManagement/AllowBasicAuthentication_Client",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteManagement/AllowBasicAuthentication_Client",
      "secretReferenceValueId": null,
      "value": "<disabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotemanagement#remotemanagement-allowbasicauthentication-service",
      "displayName": "RemoteManagement/AllowBasicAuthentication_Service",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteManagement/AllowBasicAuthentication_Service",
      "secretReferenceValueId": null,
      "value": "<disabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotemanagement#remotemanagement-allowunencryptedtraffic-client",
      "displayName": "RemoteManagement/AllowUnencryptedTraffic_Client",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteManagement/AllowUnencryptedTraffic_Client",
      "secretReferenceValueId": null,
      "value": "<disabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotemanagement#remotemanagement-allowunencryptedtraffic-service",
      "displayName": "RemoteManagement/AllowUnencryptedTraffic_Service",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteManagement/AllowUnencryptedTraffic_Service",
      "secretReferenceValueId": null,
      "value": "<disabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotemanagement#remotemanagement-disallownegotiateauthenticationclient",
      "displayName": "RemoteManagement/DisallowDigestAuthentication",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteManagement/DisallowDigestAuthentication",
      "secretReferenceValueId": null,
      "value": "<enabled />"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotemanagement#remotemanagement-disallowstoringofrunascredentials",
      "displayName": "RemoteManagement/DisallowStoringOfRunAsCredentials",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteManagement/DisallowStoringOfRunAsCredentials",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-windowsconnectionmanager",
      "displayName": "WindowsConnectionManager/ProhitConnectionToNonDomainNetworksWhenConnectedToDomainAuthenticatedNetwork",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/WindowsConnectionManager/ProhitConnectionToNonDomainNetworksWhenConnectedToDomainAuthenticatedNetwork",
      "secretReferenceValueId": null,
      "value": "<enabled/>"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-windowspowershell#windowspowershell-turnonpowershellscriptblocklogging",
      "displayName": "WindowsPowerShell/TurnOnPowerShellScriptBlockLogging",
      "isEncrypted": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/WindowsPowerShell/TurnOnPowerShellScriptBlockLogging",
      "secretReferenceValueId": null,
      "value": "<enabled/><data id=\"EnableScriptBlockInvocationLogging\" value=\"false\" />"
    }
  ],
  "supportsScopeTags": true
}