{
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "supportsScopeTags": true,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "description": null,
  "displayName": "Custom Settings",
  "version": 1,
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "Search/AllowIndexingEncryptedStoresOrItems",
      "description": "AllowIndexingEncryptedStoresOrItems",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Search/AllowIndexingEncryptedStoresOrItems",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": 0,
      "isReadOnly": false
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "LanmanWorkstation/EnableInsecureGuestLogons",
      "description": "EnableInsecureGuestLogons",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/LanmanWorkstation/EnableInsecureGuestLogons",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": 0,
      "isReadOnly": false
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "Games/AllowAdvancedGamingServices",
      "description": "AllowAdvancedGamingServices",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Games/AllowAdvancedGamingServices",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": 0,
      "isReadOnly": false
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "RemoteAssistance/SolicitedRemoteAssistance",
      "description": "SolicitedRemoteAssistance",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteAssistance/SolicitedRemoteAssistance",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cdisabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "AutoPlay/DisallowAutoplayForNonVolumeDevices",
      "description": "DisallowAutoplayForNonVolumeDevices",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/AutoPlay/DisallowAutoplayForNonVolumeDevices",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "RemoteDesktopServices/DoNotAllowDriveRedirection",
      "description": "DoNotAllowDriveRedirection",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteDesktopServices/DoNotAllowDriveRedirection",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "RemoteDesktopServices/PromptForPasswordUponConnection",
      "description": "PromptForPasswordUponConnection",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteDesktopServices/PromptForPasswordUponConnection",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "RemoteDesktopServices/RequireSecureRPCCommunication",
      "description": "RequireSecureRPCCommunication",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteDesktopServices/RequireSecureRPCCommunication",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "DeviceLock/PreventLockScreenSlideShow",
      "description": "PreventLockScreenSlideShow",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/DeviceLock/PreventLockScreenSlideShow",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "MSSecurityGuide/EnableStructuredExceptionHandlingOverwriteProtection",
      "description": "MSSecurityGuide/EnableStructuredExceptionHandlingOverwriteProtection",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSecurityGuide/EnableStructuredExceptionHandlingOverwriteProtection",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "MSSLegacy/AllowICMPRedirectsToOverrideOSPFGeneratedRoutes",
      "description": "AllowICMPRedirectsToOverrideOSPFGeneratedRoutes",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSLegacy/AllowICMPRedirectsToOverrideOSPFGeneratedRoutes",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cdisabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "MSSLegacy/AllowTheComputerToIgnoreNetBIOSNameReleaseRequestsExceptFromWINSServers",
      "description": "AllowTheComputerToIgnoreNetBIOSNameReleaseRequestsExceptFromWINSServers",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSLegacy/AllowTheComputerToIgnoreNetBIOSNameReleaseRequestsExceptFromWINSServers",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "DeviceInstallation/PreventInstallationOfMatchingDeviceIDs",
      "description": "PreventInstallationOfMatchingDeviceIDs",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/DeviceInstallation/PreventInstallationOfMatchingDeviceIDs",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e\n\u003cdata id=\"DeviceInstall_IDs_Deny_Retroactive\" value=\"true\"/\u003e\n\u003cdata id=\"DeviceInstall_IDs_Deny_List\" value=\"1\u0026#xF000;PCI\\CC_0C0A\"/\u003e\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "DeviceInstallation/PreventInstallationOfMatchingDeviceSetupClasses",
      "description": "PreventInstallationOfMatchingDeviceSetupClasses",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/DeviceInstallation/PreventInstallationOfMatchingDeviceSetupClasses",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e\n\u003cdata id=\"DeviceInstall_Classes_Deny_Retroactive\" value=\"true\"/\u003e\n\u003cData id=\"DeviceInstall_Classes_Deny_List\" value=\"1\u0026#xF000;d48179be-ec20-11d1-b6b8-00c04fa372a7\u0026#xF000;2\u0026#xF000;7ebefbc0-3200-11d2-b4c2-00a0C9697d07\u0026#xF000;3\u0026#xF000;c06ff265-ae09-48f0-812c-16753d7cba83\u0026#xF000;4\u0026#xF000;6bdd1fc1-810f-11d0-bec7-08002be2092f\"/\u003e\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "System/BootStartDriverInitialization",
      "description": "BootStartDriverInitialization",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/System/BootStartDriverInitialization",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e\n\u003cdata id=\"SelectDriverLoadPolicy\" value=\"3\"/\u003e\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "RemoteProcedureCall/RestrictUnauthenticatedRPCClients",
      "description": "RemoteProcedureCall/RestrictUnauthenticatedRPCClients",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteProcedureCall/RestrictUnauthenticatedRPCClients",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e\n\u003cdata id=\"RpcRestrictRemoteClientsList\" value=\"1\"/\u003e\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "Autoplay/SetDefaultAutoRunBehavior",
      "description": "Autoplay/SetDefaultAutoRunBehavior",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Autoplay/SetDefaultAutoRunBehavior",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e\n\u003cdata id=\"NoAutorun_Dropdown\" value=\"1\"/\u003e\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "Autoplay/TurnOffAutoPlay",
      "description": "TurnOffAutoPlay",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Autoplay/TurnOffAutoPlay",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e\n\u003cdata id=\"Autorun_Box\" value=\"255\" /\u003e\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "RemoteDesktopServices/ClientConnectionEncryptionLevel",
      "description": "ClientConnectionEncryptionLevel",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteDesktopServices/ClientConnectionEncryptionLevel",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e\n\u003cdata id=\"TS_ENCRYPTION_LEVEL\" value=\"3\"/\u003e\n"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "MSSecurityGuide/ApplyUACRestrictionsToLocalAccountsOnNetworkLogon",
      "description": "ApplyUACRestrictionsToLocalAccountsOnNetworkLogon",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSecurityGuide/ApplyUACRestrictionsToLocalAccountsOnNetworkLogon",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "MSSecurityGuide/ConfigureSMBV1ClientDriver",
      "description": "ConfigureSMBV1ClientDriver",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSecurityGuide/ConfigureSMBV1ClientDriver",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e \n\u003cdata id=\"Pol_SecGuide_SMB1ClientDriver\" value=\"4\"/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "MSSecurityGuide/ConfigureSMBV1Server",
      "description": "ConfigureSMBV1Server",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSecurityGuide/ConfigureSMBV1Server",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cdisabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "MSSecurityGuide/WDigestAuthentication",
      "description": "WDigestAuthentication",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSecurityGuide/WDigestAuthentication",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cdisabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "MSSLegacy/IPSourceRoutingProtectionLevel",
      "description": "IPSourceRoutingProtectionLevel",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSLegacy/IPSourceRoutingProtectionLevel",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e \n\u003cdata id=\"DisableIPSourceRouting\" value=\"2\"/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "MSSLegacy/IPv6SourceRoutingProtectionLevel",
      "description": "IPv6SourceRoutingProtectionLevel",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/MSSLegacy/IPv6SourceRoutingProtectionLevel",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e \n\u003cdata id=\"DisableIPSourceRoutingIPv6\" value=\"2\"/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "RemoteManagement/AllowBasicAuthentication_Client",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotemanagement#remotemanagement-allowbasicauthentication-client",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteManagement/AllowBasicAuthentication_Client",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cdisabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "RemoteManagement/AllowBasicAuthentication_Service",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotemanagement#remotemanagement-allowbasicauthentication-service",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteManagement/AllowBasicAuthentication_Service",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cdisabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "RemoteManagement/AllowUnencryptedTraffic_Client",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotemanagement#remotemanagement-allowunencryptedtraffic-client",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteManagement/AllowUnencryptedTraffic_Client",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cdisabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "RemoteManagement/AllowUnencryptedTraffic_Service",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotemanagement#remotemanagement-allowunencryptedtraffic-service",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteManagement/AllowUnencryptedTraffic_Service",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cdisabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "WindowsConnectionManager/ProhitConnectionToNonDomainNetworksWhenConnectedToDomainAuthenticatedNetwork",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-windowsconnectionmanager",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/WindowsConnectionManager/ProhitConnectionToNonDomainNetworksWhenConnectedToDomainAuthenticatedNetwork",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "Connectivity/DisableDownloadingOfPrintDriversOverHTTP",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-connectivity#connectivity-disabledownloadingofprintdriversoverhttp",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Connectivity/DisableDownloadingOfPrintDriversOverHTTP",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "Connectivity/DisableInternetDownloadForWebPublishingAndOnlineOrderingWizards",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-connectivity#connectivity-disableinternetdownloadforwebpublishingandonlineorderingwizards",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Connectivity/DisableInternetDownloadForWebPublishingAndOnlineOrderingWizards",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "AppRuntime/AllowMicrosoftAccountsToBeOptional",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-appruntime#appruntime-allowmicrosoftaccountstobeoptional",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/AppRuntime/AllowMicrosoftAccountsToBeOptional",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "FileExplorer/TurnOffHeapTerminationOnCorruption",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-fileexplorer#fileexplorer-turnoffheapterminationoncorruption",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/FileExplorer/TurnOffHeapTerminationOnCorruption",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cdisabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "FileExplorer/TurnOffDataExecutionPreventionForExplorer",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-fileexplorer#fileexplorer-turnoffdataexecutionpreventionforexplorer",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/FileExplorer/TurnOffDataExecutionPreventionForExplorer",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cdisabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "RemoteManagement/DisallowStoringOfRunAsCredentials",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotemanagement#remotemanagement-disallowstoringofrunascredentials",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteManagement/DisallowStoringOfRunAsCredentials",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "RemoteDesktopServices/DoNotAllowPasswordSaving",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotedesktopservices#remotedesktopservices-donotallowpasswordsaving",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteDesktopServices/DoNotAllowPasswordSaving",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "WindowsPowerShell/TurnOnPowerShellScriptBlockLogging",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-windowspowershell#windowspowershell-turnonpowershellscriptblocklogging",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/WindowsPowerShell/TurnOnPowerShellScriptBlockLogging",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e\u003cdata id=\"EnableScriptBlockInvocationLogging\" value=\"false\" /\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "Connectivity/HardenedUNCPaths",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-connectivity#connectivity-hardeneduncpaths",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Connectivity/HardenedUNCPaths",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled /\u003e\u003cdata id=\"Pol_HardenedPaths\" value=\"\\\\*\\SYSVOL\u0026#xF000;RequireMutualAuthentication=1,RequireIntegrity=1\u0026#xF000;\\\\*\\NETLOGON\u0026#xF000;RequireMutualAuthentication=1,RequireIntegrity=1\" /\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "CredentialsDelegation/RemoteHostAllowsDelegationOfNonExportableCredentials",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-credentialsdelegation#credentialsdelegation-remotehostallowsdelegationofnonexportablecredentials",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/CredentialsDelegation/RemoteHostAllowsDelegationOfNonExportableCredentials",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled /\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "Privacy/LetAppsActivateWithVoiceAboveLock",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-privacy#privacy-letappsactivatewithvoiceabovelock",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Privacy/LetAppsActivateWithVoiceAboveLock",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": 2,
      "isReadOnly": false
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "RemoteManagement/DisallowDigestAuthentication",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotemanagement#remotemanagement-disallownegotiateauthenticationclient",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteManagement/DisallowDigestAuthentication",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled /\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "Connectivity/ProhibitInstallationAndConfigurationOfNetworkBridge",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-Connectivity#connectivity-prohibitinstallationandconfigurationofnetworkbridge",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Connectivity/ProhibitInstallationAndConfigurationOfNetworkBridge",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled /\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "Power/AllowStandbyStatesWhenSleepingOnBattery",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-power#power-allowstandbystateswhensleepingonbattery",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Power/AllowStandbyStatesWhenSleepingOnBattery",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cdisabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "Power/AllowStandbyWhenSleepingPluggedIn",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-power#power-allowstandbywhensleepingpluggedin",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Power/AllowStandbyWhenSleepingPluggedIn",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cdisabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "EventLogService/SpecifyMaximumFileSizeSecurityLog",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-eventlogservice#eventlogservice-specifymaximumfilesizesecuritylog",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/EventLogService/SpecifyMaximumFileSizeSecurityLog",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled /\u003e\u003cdata id=\"Channel_LogMaxSize\" value=\"196608\" /\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "Network Isolation - Enterprise Proxy Servers Are Authoritative",
      "description": "Network Isolation - Enterprise Proxy Servers Are Authoritative",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/NetworkIsolation/EnterpriseProxyServersAreAuthoritative",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": 1,
      "isReadOnly": false
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "Error Reporting - Disable Windows Error Reporting",
      "description": "Error Reporting - Disable Windows Error Reporting",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/ErrorReporting/DisableWindowsErrorReporting",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": "\u003cenabled/\u003e"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingBoolean",
      "displayName": "Disable User ESP",
      "description": "Disable Enrollment Status Page post Build",
      "omaUri": "./Vendor/MSFT/DMClient/Provider/MS DM Server/FirstSyncStatus/SkipUserStatusPage",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingBoolean",
      "displayName": "Disable Device ESP",
      "description": "Disable Enrollment Status Page post Build",
      "omaUri": "./Vendor/MSFT/DMClient/Provider/MS DM Server/FirstSyncStatus/SkipDeviceStatusPage",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "Disable first sign-in animation",
      "description": "Disable first sign-in animation",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/WindowsLogon/EnableFirstLogonAnimation",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": 0,
      "isReadOnly": false
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "ConfigureSystemGuardLaunch",
      "description": "ConfigureSystemGuardLaunch",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/DeviceGuard/ConfigureSystemGuardLaunch",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": 1,
      "isReadOnly": false
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "DmaGuard/DeviceEnumerationPolicy",
      "description": "more control over the enumeration of external DMA capable devices incompatible with DMA Remapping/device memory isolation and sandboxing.",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/DmaGuard/DeviceEnumerationPolicy",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": 0,
      "isReadOnly": false
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "MDMWinsOverGP",
      "description": "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-controlpolicyconflict",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/ControlPolicyConflict/MDMWinsOverGP",
      "secretReferenceValueId": null,
      "isEncrypted": false,
      "value": 1,
      "isReadOnly": false
    }
  ]
}