{
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "displayName": "Custom Settings",
  "description": null,
  "version": 1,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingBoolean",
      "description": "Disable Enrollment Status Page post Build",
      "displayName": "Disable Device ESP",
      "isEncrypted": false,
      "omaUri": "./Vendor/MSFT/DMClient/Provider/MS DM Server/FirstSyncStatus/SkipDeviceStatusPage",
      "secretReferenceValueId": null,
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingBoolean",
      "description": "Disable Enrollment Status Page post Build",
      "displayName": "Disable User ESP",
      "isEncrypted": false,
      "omaUri": "./Vendor/MSFT/DMClient/Provider/MS DM Server/FirstSyncStatus/SkipUserStatusPage",
      "secretReferenceValueId": null,
      "value": true
    }
  ]
}