{
  "@odata.type": "#microsoft.graph.windowsHealthMonitoringConfiguration",
  "displayName": "Data Collection",
  "description": null,
  "version": 1,
  "allowDeviceHealthMonitoring": "enabled",
  "configDeviceHealthMonitoringScope": "bootPerformance,windowsUpdates"
}