{
  "@odata.type": "#microsoft.graph.windowsIdentityProtectionConfiguration",
  "displayName": "Identity Protection",
  "description": null,
  "version": 1,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "enhancedAntiSpoofingForFacialFeaturesEnabled": true,
  "pinExpirationInDays": 0,
  "pinLowercaseCharactersUsage": "allowed",
  "pinMaximumLength": null,
  "pinMinimumLength": 6,
  "pinPreviousBlockCount": 0,
  "pinRecoveryEnabled": true,
  "pinSpecialCharactersUsage": "allowed",
  "pinUppercaseCharactersUsage": "allowed",
  "securityDeviceRequired": true,
  "supportsScopeTags": true,
  "unlockWithBiometricsEnabled": true,
  "useCertificatesForOnPremisesAuthEnabled": false,
  "useSecurityKeyForSignin": false,
  "windowsHelloForBusinessBlocked": false
}