{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "displayName": "Microsoft Defender Tamper Protection",
  "description": null,
  "version": 1,
  "windowsDefenderTamperProtection": "enable"
}