{
  "name": "Microsoft Defender Antivirus Exclusions",
  "description": "",
  "platforms": "windows10",
  "technologies": "mdm",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_excludedpaths",
        "simpleSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%ProgramFiles%\\Microsoft\\"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%ProgramFiles%\\Windows Defender Advanced Threat Protection\\"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%ProgramFiles%\\Windows Defender\\"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%ProgramFiles(x86)%\\Microsoft Intune Management Extension\\Content\\"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%ProgramFiles(x86)%\\Windows Defender\\"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\IMECache\\"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\Security\\Database\\*.chk"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\Security\\Database\\*.cmtx"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\Security\\Database\\*.csv"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\Security\\Database\\*.edb"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\Security\\Database\\*.jrs"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\Security\\Database\\*.log"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\Security\\Database\\*.sdb"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\Security\\Database\\*.xml"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\SoftwareDistribution\\Datastore\\Datastore.edb"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\SoftwareDistribution\\Datastore\\Logs\\edb*.jrs"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\SoftwareDistribution\\Datastore\\Logs\\edb.chk"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\SoftwareDistribution\\Datastore\\Logs\\res*.jrs"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\SoftwareDistribution\\Datastore\\Logs\\res*.log"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\SoftwareDistribution\\Datastore\\Logs\\tmp.edb"
          }
        ]
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_excludedprocesses",
        "simpleSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%ProgramFiles%\\Windows Defender\\MSASCui.exe"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%ProgramFiles%\\Windows Defender\\MSASCuiL.exe"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%ProgramFiles%\\Windows Defender\\MpCmdRun.exe"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%ProgramFiles%\\Windows Defender\\MsMpEng.exe"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%ProgramFiles%\\Windows Defender\\NisSrv.exe"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\System32\\AppVClient.exe"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\System32\\ApplicationFrameHost.exe"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\System32\\Lsalso.exe"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\System32\\SearchIndexer.exe"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "value": "%windir%\\System32\\wlanext.exe"
          }
        ]
      }
    }
  ]
}